_Rarzrabotki/Rarus/USO2/Documents/АУН_РегистрацияОбъемовПотребленияУслугПеременнойЧасти.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>АУН_РегистрацияОбъемовПотребленияУслугПеременнойЧасти</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АУН_НачисленияПоТарифицируемымУслугам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация-арендодатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АУН_РегистрацияОбъемовПотребленияУслугПеременнойЧасти</v8:Type>
						<v8:Type>cfg:DocumentRef.АУН_ЗаключениеДоговораАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоступныеПериодыОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическоеОкончание</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическоеНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеНаКонецПериода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеНаНачалоПериода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/АУН_ОбъектыНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>АУН_ОбъектыНедвижимости</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвартиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АУН_КатегорииОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_НазначенияОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринадлежитОбъекту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/АУН_РегистрацияОбъемовПотребленияУслугПеременнойЧасти/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьРазницуПоказаний();
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПериод(Команда)

	Оповещение = Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект);
	АУН_ОбщиеПроцедурыКлиент.ВыборПериодаПоДоговору(Объект.ДатаЗаключенияДоговора, Объект.ДатаОкончанияДоговора, Объект.Договор, Оповещение);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
	ЦенаУслуги = ПолучитьЦенуУслугиПоДокументуОснованию();
	
	Для Каждого СтрокаТЧ ИЗ Объект.Показания Цикл
		
		СтрокаТЧ.Цена = ЦенаУслуги;
		РассчитатьСтроку(СтрокаТЧ); 		
		
	КонецЦикла;   	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказания

&НаКлиенте
Процедура ПоказанияПоказаниеНаНачалоПериодаПриИзменении(Элемент)
	
	РассчитатьСтроку(Элементы.Показания.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоказаниеНаКонецПериодаПриИзменении(Элемент)
	
	РассчитатьСтроку(Элементы.Показания.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияКоэффициентОтнесенияСчетчикаПриИзменении(Элемент)
	
	РассчитатьСтроку(Элементы.Показания.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриИзменении(Элемент)
	
	РассчитатьИтоговуюРазницу();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.Показания.ТекущиеДанные;
		ТекущиеДанные.ФактическоеНачало = Объект.НачалоПериода;
		ТекущиеДанные.ФактическоеОкончание = Объект.ОкончаниеПериода;
		ТекущиеДанные.Цена = ПолучитьЦенуУслугиПоДокументуОснованию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуУслугиПоДокументуОснованию()
	
	Если ТипЗнч(Объект.ДокументОснование) <> Тип("ДокументСсылка.АУН_ЗаключениеДоговораАренды") Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Услуга) Тогда
		Возврат 0;
	КонецЕсли;
	
	Строка = Объект.ДокументОснование.ПостояннаяЧастьАренднойПлаты.Найти(Объект.Услуга,"Номенклатура");
	
	Если Строка = Неопределено Тогда
		
		Строка = Объект.ДокументОснование.ПеременнаяЧастьАренднойПлаты.Найти(Объект.Услуга,"Номенклатура");
		
	КонецЕсли;
	
	Если Строка = Неопределено Тогда
		
		Возврат 0;
		
	КонецЕсли;
	
	Возврат Строка.Ставка;
	
КонецФункции


&НаКлиенте
Процедура ПоказанияЦенаПриИзменении(Элемент)
	
	РассчитатьСтроку(Элементы.Показания.ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПартнерПриИзменении(Элемент)
	
	СтруктураСвойств = Новый Структура("Партнер, Контрагент");
	ЗаполнитьЗначенияСвойств(СтруктураСвойств, Элементы.Показания.ТекущиеДанные);
	ПоказанияПартнерПриИзмененииНаСервере(СтруктураСвойств);
	ЗаполнитьЗначенияСвойств(Элементы.Показания.ТекущиеДанные, СтруктураСвойств);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);

	Если НЕ (ЗначениеЗаполнено(Объект.НачалоПериода) ИЛИ ЗначениеЗаполнено(Объект.ОкончаниеПериода)) Тогда
		АУН_ОбщиеПроцедуры.ЗаполнитьПериодПоУмолчанию(Объект);
	КонецЕсли;

	ЗаполнитьРазницуПоказаний();
	РассчитатьИтоговуюРазницу();
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры // ПодготовитьФормуНаСервере()

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Форма.Период = ВыборПериодаКлиентСервер.ПолучитьПредставлениеПериодаОтчета(Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры // УправлениеФормой()

#КонецОбласти

#Область ПриИзмененииРеквизитов

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьПодчиненныеСвойства(Объект, "Организация");
	
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПартнерПриИзмененииНаСервере()
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
	
КонецПроцедуры

#КонецОбласти

#Область ПриИзмененииРеквизитовТабличнойЧасти

&НаКлиенте
Процедура РассчитатьСтроку(СтрокаТЧ)
	
	СтрокаТЧ.Разница = (СтрокаТЧ.ПоказаниеНаКонецПериода - СтрокаТЧ.ПоказаниеНаНачалоПериода);
	СтрокаТЧ.Сумма = СтрокаТЧ.Разница * СтрокаТЧ.Цена;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтоговуюРазницу()
	
	Сумма = 0;
	Для Каждого СтрокаТЧ Из Объект.Показания Цикл
		Сумма = Сумма + (СтрокаТЧ.ПоказаниеНаКонецПериода - СтрокаТЧ.ПоказаниеНаНачалоПериода);
	КонецЦикла;
	РазницаИтого = Сумма;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазницуПоказаний()
	
	Для каждого СтрокаТЧ Из Объект.Показания Цикл
		СтрокаТЧ.Разница = (СтрокаТЧ.ПоказаниеНаКонецПериода - СтрокаТЧ.ПоказаниеНаНачалоПериода);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПоказанияПартнерПриИзмененииНаСервере(ТекДанные)

	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(ТекДанные.Партнер, ТекДанные.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияОбъектАрендыОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.АУН_ОбъектыНедвижимости.Форма.АУН_ФормаЭлемента", Новый Структура("Ключ", Элементы.Показания.ТекущиеДанные.ОбъектАренды));
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСПериодом

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)	
	
	ВыборПериодаКлиент.ВидПериодаПриИзменении(Элемент, Объект.ВидПериода, Объект.НачалоПериода, Объект.ОкончаниеПериода, Период);
	
	Для Каждого СтрокаТЧ ИЗ Объект.Показания Цикл
		
		СтрокаТЧ.ФактическоеНачало = Объект.НачалоПериода;
		СтрокаТЧ.ФактическоеОкончание = Объект.ОкончаниеПериода;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	// {УСО 2.0}:{Управление строительной организацией}{Мокшанов А.О.} {{ 
	ВыборПериодаКлиент.ПериодПриИзменении(Элемент, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	//ОтчетыУТКлиентСервер.ПериодПриИзменении(Элемент, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	// {УСО 2.0}:{Управление строительной организацией}{Мокшанов А.О.} }}
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ПериодНачалоВыбораПродолжение",ЭтотОбъект);
	
	ВыборПериодаКлиент.ПериодНачалоВыбора(ЭтаФорма,Элемент,СтандартнаяОбработка,Объект.ВидПериода,Объект.НачалоПериода,Оповещение);
		
КонецПроцедуры

&НаКлиенте
Процедура  ПериодНачалоВыбораПродолжение(ДопПараметры,ДанныеВыбора) Экспорт
	
	Если ДопПараметры.НачалоПериода = Дата(1,1,1) Тогда
		ВОзврат;
	КонецЕсли;
	
	Объект.НачалоПериода = ДопПараметры.НачалоПериода;
	Объект.ОкончаниеПериода = ДопПараметры.КонецПериода; 
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПериодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// {УСО 2.0}:{Управление строительной организацией}{Мокшанов А.О.} {{ 
	ВыборПериодаКлиент.ПериодОбработкаВыбора(
	//ОтчетыУТКлиентСервер.ПериодОбработкаВыбора(
	// {УСО 2.0}:{Управление строительной организацией}{Мокшанов А.О.} }}
		Элемент, ВыбранноеЗначение, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	// {УСО 2.0}:{Управление строительной организацией}{Мокшанов А.О.} {{ 
	ВыборПериодаКлиент.ПериодАвтоПодбор(
	//ОтчетыУТКлиентСервер.ПериодАвтоПодбор(
	// {УСО 2.0}:{Управление строительной организацией}{Мокшанов А.О.} }}
		Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	// {УСО 2.0}:{Управление строительной организацией}{Мокшанов А.О.} {{
	ВыборПериодаКлиент.ПериодОкончаниеВводаТекста(
	//ОтчетыУТКлиентСервер.ПериодОкончаниеВводаТекста(
	// {УСО 2.0}:{Управление строительной организацией}{Мокшанов А.О.} }}
		Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка,
		Объект.ВидПериода, Период, Объект.НачалоПериода, Объект.ОкончаниеПериода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияОбъектАрендыПриИзменении(Элемент) 	
	
	ПоказанияОбъектАрендыПриИзмененииНаСервере(Элементы.Показания.ТекущиеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура ПоказанияОбъектАрендыПриИзмененииНаСервере(ИД) 
	
	ТекСтрока = Объект.Показания.НайтиПоИдентификатору(ИД);
	
	ОбъектАренды = ТекСтрока.ОбъектАренды;
	
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.АУН_ЗаключениеДоговораАренды") Тогда
		
		СтрокаДокумента = Объект.ДокументОснование.ПостояннаяЧастьАренднойПлаты.Найти(ОбъектАренды,"ОбъектАренды");
		
		Если СтрокаДокумента <> Неопределено Тогда
			
			ТекСтрока.Площадь = СтрокаДокумента.Количество;
			
			Возврат;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.АУН_РегистрацияОбъемовПотребленияУслугПеременнойЧасти") Тогда
		
		СтрокаДокумента = Объект.ДокументОснование.Показания.Найти(ОбъектАренды,"ОбъектАренды");
		Если СтрокаДокумента <> Неопределено Тогда
			ТекСтрока.Площадь = СтрокаДокумента.Площадь;
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	ТекСтрока.Площадь = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПериодаПриИзменении(Элемент)
	
	Объект.НачалоПериода = Мин(Объект.НачалоПериода,Объект.ОкончаниеПериода);
	ВидПериодаПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	Объект.ОкончаниеПериода = Макс(Объект.НачалоПериода,Объект.ОкончаниеПериода);
	ВидПериодаПриИзменении(Элемент);
	
КонецПроцедуры


#КонецОбласти
